hw2/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.setRatings
    if params[:ratings] == nil and params[:sortBy] == nil
      if session[:r] != nil and session[:sortBy] != nil
        flash.keep
        redirect_to movies_path :sortBy => session[:sortBy], :ratings => session[:r]
      elsif session[:sortBy] != nil
        flash.keep
        redirect_to movies_path :sortBy => session[:sortBy]
      elsif session[:r] != nil
        flash.keep
        redirect_to movies_path :ratings=> session[:r]
      end
    end

    if params[:ratings] != nil
      if params[:ratings].is_a? Hash
        session[:r] = params[:ratings].keys
      else
        session[:r] = params[:ratings]
      end
    elsif session[:r] == nil
      session[:r] = Movie.setRatings
    end

    if params[:sortBy] != nil
      session[:sortBy] = params[:sortBy]
    end

    if session[:sortBy] == 'title'
      @movies = Movie.find(:all, :conditions => {:rating => session[:r]}, :order => :title)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date